namespace TelegramBot.Handlers.ChainLinks.Constants;

public static class DescriptionConstants
{
    public static string StartDescription =>
        """
        Добро пожаловать в путешествие через времена 20 века! 💡✨ Разгадывайте увлекательные факты о прошлом или проверьте свои знания с помощью тестов. Давайте вместе раскроем тайны истории XX века! 🚀🕰️

        Выберите "Факты", чтобы узнать несколько интересных аспектов. 🧠
        Или "Проверить знания", чтобы стать настоящим мастером истории! 📚

        Не забывайте быть внимательными, отправляя свои ответы!
        """;

    public static string QuestionMenuDescription =>
        """
        🧠📚 Готовьтесь к захватывающему путешествию в историю 20 века.

        Смело отвечайте на вопросы, проверьте свои знания.
        Удачи, станьте мастером истории! 🌐🚀
        """;
}