CREATE TABLE Facts
(
    Fact_ID   SERIAL PRIMARY KEY,
    Fact_Text TEXT NOT NULL
);

INSERT INTO Facts (Fact_Text)
VALUES (E'В период с 1959 по 1961 годы, когда от массового голода в Китайской Народной Республике, только по официальным данным, погибло около 15 миллионов человек 🦴. \n\nАкадемические источники по-разному оценивают число жертв голода — от 16,5 до 45 млн человек');

INSERT INTO Facts (Fact_Text)
VALUES (E'Поставки союзников Советскому Союзу в 1941-1945 годах стоили более $13 млрд 💵');

INSERT INTO Facts (Fact_Text)
VALUES (E'Берлинская стена пала в 1989 году. 🧱🧱🧱 \n\nСтена существовала чуть менее 29 лет.\nОбщая протяжённость стены составляла 155 км');

INSERT INTO Facts (Fact_Text)
VALUES (E'Первый космический полет (Полет Гагарина в космос) могли перенести 🚀. \n\nЮрий Гагарин уже лежал в кабине «Востока», когда выяснилось, что люк с герметизирующей крышкой закрылся не до конца — не сработал один из контактов. \n\nДо Сергея Королева дошли слухи, что американцы пошлют своего космонавта уже через неделю, поэтому инеженерам пришлось в кратчайшие сроки снять более 3 десятков гаек, чтобы проверить контакты.');

INSERT INTO Facts (Fact_Text)
VALUES (E'В России женщины получили полное избирательное право, включая возможность самостоятельно голосовать, только весной 1917 года (всего лишь немногим более 100 лет назад). \n\nЧерез 11 лет появится первый в мире цветной телевизор 📺');

INSERT INTO Facts (Fact_Text)
VALUES (E'В 1927 году в Массачусетском технологическом институте (MIT) Вэниваром Бушем был разработан первый механический аналоговый компьютер 💻. \n\nА первое электронное письмо было отправлено инженером американской компьютерной компании BBN Technologies Рэйем Томлинсоном в 1972 году. 📧 \nВсего через 33 года после этого на YouTube будет загружено первое видео. 📺');

INSERT INTO Facts (Fact_Text)
VALUES (E'Энигма - шифровальная машина, которая была придумана в Германии после 1 мировой войны 📜. При помощи нее немцы контролировали половину Атлантики, планируя военные операции "под носом" у союзников. \n\nВзломать ее было почти невозможно, ведь существовало около 100000000000000 (100 триллионов) вариантов шифра, который вдобавок меняли почти каждый день. \nНо Алан Тьюринг разгадал этот шифр. Он построил собственный компьютер, который находил повторяющиеся из раза в раз приветствия, координаты, прогнозы погоды в немецких посланиях и каждый день раз за разом взламывал шифр. ☁️ 👋');

INSERT INTO Facts (Fact_Text)
VALUES (E'16 февраля 1923 года наконец-то был достигнут самый центр гробницы Тутанхамона 🪦.\nПримерно через 70 лет будет запущена первая в мире web-страница 🛜');

INSERT INTO Facts (Fact_Text)
VALUES (E'Между началом первой мировой войны 🪖 и строительством Бурдж-Халифа 🌇 прошло чуть менее 100 лет (90, если быть точным)');

INSERT INTO Facts (Fact_Text)
VALUES (E'Во время холокоста погибло около миллиона евреев. \n\nДля сравнения: количество жителей государства Израиль в момент его создания составляло 806000 человек 👪👨‍👩‍👧‍👦👩‍👧‍👦');

INSERT INTO Facts (Fact_Text)
VALUES (E'Первая успешная трансплантация органа была проведена в 1954 году.\n\n На тот момент первый антибиотик был открыт Александром Флемингом всего лишь 30 лет назад (в 1928 году). При этом первый успешный режим комбинированной химиотерапии был разработан в 1963 году (всего через 35 лет после открытия первого антибиотка) 😷');

INSERT INTO Facts (Fact_Text)
VALUES (E'Всего чуть менее 150 лет прошло с момента отмены рабства в США и первой инагурацией чернокожего президента в США (1862 и 2008 год) ');

INSERT INTO Facts (Fact_Text)
VALUES (E'Ан 225 МРИЯ был самым большим и грузоподъёмным самолётом за всю историю мировой авиации. ✈️ \n\nВсего 81 год прошел с момента создания первого самолета в мире, который смог самостоятельно совершить устойчивый управляемый горизонтальный полёт и созданием самого большого и самого грузоподъемного самолета в мире.');

INSERT INTO Facts (Fact_Text)
VALUES (E'Benz Patent-Motorwagen — первый в мире автомобиль с двигателем внутреннего сгорания, построенный в 1885 году немецким изобретателем Карлом Бенцем. 🚗 \n\nВсего через 25 лет в 1910 году Генри Форд построил и запустил самый современный по тем временам завод в автомобильной промышленности, на котором начался первый эксперимент по использованию сборочного конвейера 🏗️🏭');

INSERT INTO Facts (Fact_Text)
VALUES (E'Законодательство США допускало отправку детей по почте до 1913 года. 🧒');

INSERT INTO Facts (Fact_Text)
VALUES (E'В резерве компании Apple на момент 2011 года было около 76,4млрд долларов. \n\nВ то время операционный баланс США составлял 73,7млрд долларов (что почти на 3млрд меньше, чем у компании Стива Джобса 🍎)');

INSERT INTO Facts (Fact_Text)
VALUES (E'Время относительно. \n\nКлеопатра жила ближе по времени к полёту на Луну, чем к строительству пирамид ⏳');

INSERT INTO Facts (Fact_Text)
VALUES (E'Трёхсоттридцатипятилетняя война (335) — война между Нидерландами и архипелагом Силли, входящим в состав Великобритании. \n\nИз-за отсутствия мирного договора она формально продолжалась 335 лет без единого выстрела, что делает её одной из самых длинных войн в истории. \n\nНесмотря на неопределённые действия во время объявления войны, мир, наконец, был объявлен в 1986 году. 🕊️🪖');

INSERT INTO Facts (Fact_Text)
VALUES (E'В Великой Отечественной войне участвовал красноармеец-пулемётчик с именем Семён Константинович Гитлер, который по национальности был евреем.');

INSERT INTO Facts (Fact_Text)
VALUES (E'Оксфордский университет старше ацтеков. \n\nОбучение в Оксфорде началось в 1096 году. А цивилизация ацтеков существовала в XIV—XVI веках нашей эры 🏫');

INSERT INTO Facts (Fact_Text)
VALUES (E'«Звездные войны» вышли в год последней казни на гильотине во Франции 🌠');

INSERT INTO Facts (Fact_Text)
VALUES (E'Небольшая популяция мамонтов жила на острове Врангеля в Северном Ледовитом океане до 2000-х годов до н.э. \n\nСоответственно, пирамиды Гизы строились, когда эти млекопитающие еще существовали. 🐘');
