CREATE TABLE IF NOT EXISTS Facts
(
    FactID SERIAL PRIMARY KEY,
    FactText TEXT NOT NULL
);

INSERT INTO Facts (FactText)
VALUES ('В период с 1959 по 1961 годы, когда от массового голода в Китайской Народной Республике, только по официальным данным, погибло около 15 миллионов человек. Академические источники по-разному оценивают число жертв голода — от 16,5 до 45 млн человек');

INSERT INTO Facts (FactText)
VALUES ('Поставки союзников Советскому Союзу в 1941-1945 годах стоили более $13 млрд');

INSERT INTO Facts (FactText)
VALUES ('Берлинская стена пала в 1989 году. Стена существовала чуть менее 29 лет. Общая протяжённость стены составляла 155 км');

INSERT INTO Facts (FactText)
VALUES ('Первый космический полет (Полет Гагарина в космос) могли перенести. Юрий Гагарин уже лежал в кабине «Востока», когда выяснилось, что люк с герметизирующей крышкой закрылся не до конца — не сработал один из контактов. До Сергея Королева дошли слухи, что американцы пошлют своего космонавта уже через неделю, поэтому инеженерам пришлось в кратчайшие сроки снять более 3 десятков гаек, чтобы проверить контакты.');

INSERT INTO Facts (FactText)
VALUES ('В России женщины получили полное избирательное право, включая возможность самостоятельно голосовать, только весной 1917 года (всего лишь немногим более 100 лет назад). Через 11 лет появится первый в мире цветной телевизор');

INSERT INTO Facts (FactText)
VALUES ('В 1927 году в Массачусетском технологическом институте (MIT) Вэниваром Бушем был разработан первый механический аналоговый компьютер. А первое электронное письмо было отправлено инженером американской компьютерной компании BBN Technologies Рэйем Томлинсоном в 1972 году. Всего через 33 года после этого на YouTube будет загружено первое видео.');

INSERT INTO Facts (FactText)
VALUES ('Энигма - шифровальная машина, которая была придумана в Германии после 1 мировой войны. При помощи нее немцы контролировали половину Атлантики, планируя военные операции "под носом" у союзников. Взломать ее было почти невозможно, ведь существовало около 100000000000000 (триллионов) вариантов шифра, который вдобавок меняли почти каждый день. Алан Тьюринг разгадал этот шифр. Он построил собственный компьютер, который находил повторяющиеся из раза в раз приветствия, координаты, прогнозы погоды в немецких посланиях и каждый день раз за разом взламывал шифр.');

INSERT INTO Facts (FactText)
VALUES ('16 февраля 1923 года Картер наконец-то достиг самого центра гробницы Тутанхамона. Примерно через 70 лет будет запущена первая в мире web-страница');

INSERT INTO Facts (FactText)
VALUES ('Между началом первой мировой войны и строительством Бурдж-Халифа чуть менее 100 лет (90)');

INSERT INTO Facts (FactText)
VALUES ('Во время холокоста погибло около миллиона евреев. Для сравнения: количество жителей государства Израиль в момент его создания составляло 806000 человек');

INSERT INTO Facts (FactText)
VALUES ('Первая успешная трансплантация органа была проведена в 1954 году. На тот момент первый антибиотик был открыт Александром Флемингом всего лишь 30 лет назад (в 1928 году). При этом первый успешный режим комбинированной химиотерапии был разработан в 1963 году (всего через 35 лет после открытия первого антибиотка)');

INSERT INTO Facts (FactText)
VALUES ('Всего чуть менее 150 лет прошло с момента отмены рабства и первой инагурацией чернокожего президента в США (1862 и 2008 год)');

INSERT INTO Facts (FactText)
VALUES ('Ан 225 МРИЯ был самым большим и грузоподъёмным самолётом за всю историю мировой авиации. Всего 81 год прошел с момента создания первого самолета в мире, который смог самостоятельно совершить устойчивый управляемый горизонтальный полёт и созданием самого большого и самого грузоподъемного самолета в мире.');

INSERT INTO Facts (FactText)
VALUES ('Benz Patent-Motorwagen — первый в мире автомобиль с двигателем внутреннего сгорания, построенный в 1885 году немецким изобретателем Карлом Бенцем. Всего через 25 лет в 1910 году Генри Форд построил и запустил самый современный по тем временам завод в автомобильной промышленности, на котором начался первый эксперимент по использованию сборочного конвейера');

